cf/InformationRegisters/BookkeepingPostingSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>BookkeepingPostingSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>BookkeepingPostingType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BookkeepingPostingTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/AlertType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>AlertType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Warning</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Error</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/InformationRegisters/BookkeepingPostingSettings/Ext/RecordSetModule.bsl
Procedure BeforeWrite(Cancel, Replacing)
	
	For Each Record In ThisObject Do
		
		If Record.Object = Undefined Then 
			Alerts.AddAlert(Nstr("en='Document type should be selected!';pl='Nalezy wybrać typ dokumentu!';ru='Выберите тип документа!'"),Enums.AlertType.Error,Cancel);
			Break;
		EndIf;
		
		If ValueIsNotFilled(Record.BookkeepingPostingType) Then 
			Alerts.AddAlert(Nstr("en='Bookkeeping posting type should be selected!';pl='Nalezy wybrać typ księgowania dla dokumentu!';ru='Выберите способ проведения документа!'"),Enums.AlertType.Error,Cancel);
			break;
		EndIf;
		
	EndDo;
	
EndProcedure
